hardware/ultrasonic_anemometer/sim/openfoam/matrix/anemometer_u5_yaw0/system/surfaceFeatureExtractDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object surfaceFeatureExtractDict;
}

anemometer_outer.stl
{
    extractionMethod extractFromSurface;

    extractFromSurfaceCoeffs
    {
        includedAngle 150;
    }

    writeObj yes;
}
